srvdiscovery/servicediscoveryandcontrol/pnp/test/upnp/IntegTest/testupnp/TestData/Data_Files/xmldatafiles/action.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<s:Body>
<u:SetTarget xmlns:u="urn:schemas-upnp-org:service:SwitchPower:1">
<newTargetValue>0</newTargetValue>
</u:SetTarget>
</s:Body>
</s:Envelope>